#include "adc.h"

/****************************************************************************
* Function Name  : ADC_Config
* Description    : 初始化ADC
* Input          : adc：选择初始化的ADC，（我们开发板上面有三个ADC输入）
* Output         : None
* Return         : None
****************************************************************************/

void ADC_Config(uint8_t adc)
{
    uint32_t tmpreg;
/***************************************************************************/
/********************** IO口模式配置 ***************************************/
/***************************************************************************/

    if((adc & ADC_Chn0) == ADC_Chn0) //如果选择打开ADC0
    {
       
        /* 打开时钟 */ 
        RCC->APB2ENR |= 0x00000008;
        
        GPIOB->CRL &= 0xFFFFFFF0;   //PB0设置成模拟输入
        GPIOB->CRL |= 0x00000000;
    }
    if((adc & ADC_Chn1) == ADC_Chn1)
    {
        /* 打开时钟 */
        RCC->APB2ENR |= 0x00000008;
        
        GPIOB->CRL &= 0xFFFFFF0F;   //PB1设置成模拟输入
        GPIOB->CRL |= 0x00000000;

    }
    if((adc & ADC_Chn2) == ADC_Chn2)
    {
        /* 打开时钟 */
        RCC->APB2ENR |= 0x00000004;
        
        GPIOA->CRL &= 0xFFFFFF0F;   //PA1设置成模拟输入
        GPIOA->CRL |= 0x00000000;
    }

/***************************************************************************/
/*********************** ADC参数设置 ***************************************/
/***************************************************************************/

	/* 打开时钟 */
    RCC->APB2ENR |= 0x00000200;
    tmpreg = RCC->CFGR;
    tmpreg &= ~(3 << 14);
    tmpreg |= 2 << 14;   //6分频 72M/6=12,ADC 最大时钟不能超过 14M
    RCC->CFGR = tmpreg;

	/* 初始化ADC参数 */
    ADC1->CR1 &= 0xF0FFFF;     //工作模式清零
	ADC1->CR1 |= 0 << 16;      //独立工作模式

    ADC1->CR1 &= ~(1 << 8);    //非扫描模式	  
	ADC1->CR2 &= ~(1 << 1);    //单次转换模式
	ADC1->CR2 &= ~(7 << 17);	   
	ADC1->CR2 |= 7 << 17;	   //软件控制转换  
	ADC1->CR2 |= 1 << 20;      //使用用外部触发(SWSTART)!!!	必须使用一个事件来触发
	ADC1->CR2 &= ~(1 << 11);   //右对齐	 
	ADC1->SQR1 &= ~(0XF << 20);
	ADC1->SQR1 |= 0;           //1个转换在规则序列中 也就是只转换规则序列1 			   
	/* 设置通道1的采样时间 */
	ADC1->SMPR2 &= ~(7 << 3);  //通道1采样时间清空	  
 	ADC1->SMPR2 |= 7 << 3;     //通道1  239.5周期,提高采样时间可以提高精确度	 
	ADC1->CR2 |= 1;	           //开启AD转换器	 
	ADC1->CR2 |= 1 << 3;       //使能复位校准  
	while(ADC1->CR2 & (1 << 3)); //等待校准结束 			 
    /* 该位由软件设置并由硬件清除。在校准寄存器被初始化后该位将被清除。*/ 		 
	ADC1->CR2 |= 1 << 2;         //开启AD校准	   
	while(ADC1->CR2 & (1 << 2)); //等待校准结束
      
}

/****************************************************************************
* Function Name  : ADC_ReadChn0
* Description    : 读取一次ADC0的转换结果
* Input          : None
* Output         : None
* Return         : 一个12位的转换结果
****************************************************************************/

uint16_t ADC_ReadChn0(void)
{
    uint16_t Value;

    /* 设置通道8(ADC0是PB0是通道8)的采样时间为  239.5周期。*/
    ADC1->SMPR2 &= ~(7 << 24);
    ADC1->SMPR2 |= 7 << 24;

    /* 规则采样顺序值为1 ,通道8*/
    ADC1->SQR3 &= ~0x1F;
    ADC1->SQR3 |= 8;

    ADC1->CR2 |= 1 << 22;        //启动规则转换通道
    while(!(ADC1->SR & 0x02));   //等待转换结束

	/* 读取ADC1规则组的转换结果 */	
	Value = ADC1->DR;; 
    
    return Value;
}

/****************************************************************************
* Function Name  : ADC_ReadChn1
* Description    : 读取一次ADC1的转换结果
* Input          : None
* Output         : None
* Return         : 一个12位的转换结果
****************************************************************************/

uint16_t ADC_ReadChn1(void)
{
    uint16_t Value;

    /* ADC1是PB1是通道9，规则采样顺序值为1，采样时间为 239.5周期。 */
    /* 设置通道9(ADC1是PB1是通道9)的采样时间为  239.5周期。*/
    ADC1->SMPR2 &= ~(7 << 27);
    ADC1->SMPR2 |= 7 << 27;

    /* 规则采样顺序值为1 ,通道9*/
    ADC1->SQR3 &= ~0x1F;
    ADC1->SQR3 |= 9;

    ADC1->CR2 |= 1 << 22;        //启动规则转换通道
    while(!(ADC1->SR & 0x02));   //等待转换结束

	/* 读取ADC1规则组的转换结果 */	
	Value = ADC1->DR; 
    
    return Value;
}

/****************************************************************************
* Function Name  : ADC_ReadChn2
* Description    : 读取一次ADC2的转换结果
* Input          : None
* Output         : None
* Return         : 一个12位的转换结果
****************************************************************************/

uint16_t ADC_ReadChn2(void)
{
    uint16_t Value;

    /* ADC2是PA1是通道1，规则采样顺序值为1，采样时间为 239.5周期。 */
    /* 设置通道9(ADC2是PA1是通道1)的采样时间为  239.5周期。*/
    ADC1->SMPR2 &= ~(7 << 3);
    ADC1->SMPR2 |= 7 << 3;

    /* 规则采样顺序值为1 ,通道1*/
    ADC1->SQR3 &= ~0x1F;
    ADC1->SQR3 |= 1;

    ADC1->CR2 |= 1 << 22;        //启动规则转换通道
    while(!(ADC1->SR & 0x02));   //等待转换结束

	/* 读取ADC1规则组的转换结果 */	
	Value = ADC1->DR; 
    
    return Value;
}

